# Imbalanced Dataset

In [3]:
# Is an instance where a dataset contains an unequal class distribution

In [31]:
# Import libraries
import numpy as np
import pandas as pd
# import sklearn.datasets

In [33]:
# load the dataset into a pandas dataframe
# dataset = sklearn.datasets.load_diabetes()

In [35]:
# dataset

In [38]:
dataset = pd.read_csv("/Users/balogunishaq/Desktop/Complete Machine Learning Course - Siddhardhan/datasets/SalesPredictData.csv")

In [40]:
dataset

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3   12.0
3    151.5   41.3       58.5   16.5
4    180.8   10.8       58.4   17.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

[200 rows x 4 columns]

In [42]:
dataset.head()

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3   12.0
3  151.5   41.3       58.5   16.5
4  180.8   10.8       58.4   17.9

In [44]:
dataset.tail()

        TV  Radio  Newspaper  Sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

In [48]:
# Distribution of the two classes
dataset['Sales'].value_counts()

Sales
11.9    5
16.7    5
20.7    4
11.0    3
11.3    3
       ..
13.4    1
24.2    1
8.1     1
5.5     1
25.5    1
Name: count, Length: 121, dtype: int64

In [63]:
# Separating the values of 'sales'
sales1 = dataset[dataset.Sales >= 5.0]
sales2 = dataset[dataset.Sales >= 10.0]
sales3 = dataset[dataset.Sales >= 20.0]
sales4 = dataset[dataset.Sales >= 30.0]

In [67]:
print(sales1.shape, sales2.shape, sales3.shape, sales4.shape)

(197, 4) (166, 4) (40, 4) (0, 4)

# Under-sampling

In [70]:
sales1 = sales1.sample(n=197)

In [72]:
print(sales1)

        TV  Radio  Newspaper  Sales
197  177.0    9.3        6.4   14.8
42   293.6   27.7        1.8   20.7
72    26.8   33.0       19.3    8.8
189   18.7   12.1       23.4    6.7
14   204.1   32.9       46.0   19.0
..     ...    ...        ...    ...
148   38.0   40.3       11.9   10.9
92   217.7   33.5       59.0   19.4
146  240.1    7.3        8.7   18.2
16    67.8   36.6      114.0   12.5
87   110.7   40.6       63.2   16.0

[197 rows x 4 columns]

In [74]:
sales2 = sales2.sample(n=166)

In [76]:
print(sales2)

        TV  Radio  Newspaper  Sales
17   281.4   39.6       55.8   24.4
52   216.4   41.7       39.6   22.6
199  232.1    8.6        8.7   18.4
35   290.7    4.1        8.5   17.8
86    76.3   27.5       16.0   12.0
..     ...    ...        ...    ...
32    97.2    1.5       30.0   13.2
116  139.2   14.3       25.6   12.2
180  156.6    2.6        8.3   15.5
68   237.4   27.5       11.0   18.9
146  240.1    7.3        8.7   18.2

[166 rows x 4 columns]

In [78]:
sales3 = sales3.sample(n=40)

In [80]:
print(sales3)

        TV  Radio  Newspaper  Sales
101  296.4   36.3      100.9   23.8
175  276.9   48.9       41.8   27.0
84   213.5   43.0       33.8   21.7
54   262.7   28.8       15.9   20.2
97   184.9   21.0       22.0   20.5
53   182.6   46.2       58.7   21.2
128  220.3   49.0        3.2   24.7
139  184.9   43.9        1.7   20.7
69   216.8   43.9       27.2   22.3
104  238.2   34.3        5.3   20.7
27   240.1   16.7       22.9   20.9
93   250.9   36.5       72.3   22.2
147  243.2   49.0       44.3   25.4
55   198.9   49.4       60.0   23.7
52   216.4   41.7       39.6   22.6
58   210.8   49.6       37.7   23.8
183  287.6   43.0       71.8   26.2
15   195.4   47.7       52.9   22.4
36   266.9   43.8        5.0   25.4
47   239.9   41.5       18.5   23.2
98   289.7   42.3       51.2   25.4
62   239.3   15.5       27.3   20.7
111  241.7   38.0       23.2   21.8
17   281.4   39.6       55.8   24.4
185  205.0   45.1       19.6   22.6
85   193.2   18.4       65.7   20.2
188  286.0   13.9        3.7   20.9
0    230.1   37.8       69.2   22.1
169  284.3   10.6        6.4   20.0
176  248.4   30.2       20.3   20.2
30   292.9   28.3       43.2   21.4
113  209.6   20.6       10.7   20.9
198  283.6   42.0       66.2   25.5
61   261.3   42.7       54.7   24.2
39   228.0   37.7       32.0   21.5
137  273.7   28.9       59.7   20.8
142  220.5   33.2       37.9   20.1
154  187.8   21.1        9.5   20.6
42   293.6   27.7        1.8   20.7
23   228.3   16.9       26.2   20.5

In [84]:
sales4 = sales4.sample(n=0)

In [86]:
print(sales4)

Empty DataFrame
Columns: [TV, Radio, Newspaper, Sales]
Index: []

# Concatenate the DataFrames

In [89]:
new_dataset = pd.concat([sales1, sales2, sales3], axis= 0)

In [91]:
new_dataset.head()

        TV  Radio  Newspaper  Sales
197  177.0    9.3        6.4   14.8
42   293.6   27.7        1.8   20.7
72    26.8   33.0       19.3    8.8
189   18.7   12.1       23.4    6.7
14   204.1   32.9       46.0   19.0

In [93]:
new_dataset.tail()

        TV  Radio  Newspaper  Sales
137  273.7   28.9       59.7   20.8
142  220.5   33.2       37.9   20.1
154  187.8   21.1        9.5   20.6
42   293.6   27.7        1.8   20.7
23   228.3   16.9       26.2   20.5

In [95]:
new_dataset['Sales'].value_counts()

Sales
20.7    12
11.9    10
16.7    10
20.9     9
20.2     9
        ..
5.9      1
9.6      1
5.6      1
7.0      1
8.5      1
Name: count, Length: 118, dtype: int64